# configs/yolov12n_vsod.yaml  —  VSOD v4 (fixed args format)
# =============================================================================
# ROOT CAUSE CUỐI CÙNG:
#   parse_model TỰ CHÈN outer-n vào args[2].
#   Nếu args = [c2, n, c3k, e], sau chèn thành [c1, c2, n_outer, n_inner, c3k, e]
#   → c3k = n_inner (truthy int), e = c3k (False → 0)
#   → self.c = int(c2 * 0) = 0 → PSABlock(0) → key_dim=0 → ZeroDivisionError!
#
# FIX: KHÔNG để explicit n trong args — dùng cột n ngoài để parse_model tự chèn.
#   WRONG: [-1, 1, C3k2, [64, 1, False, 0.25]]
#          → parse_model inserts n=1 → C3k2(c1, 64, 1, 1, False=e=0) → CRASH
#   RIGHT: [-1, 1, C3k2, [64, False, 0.25]]
#          → parse_model inserts n=1 → C3k2(c1, 64, 1, False, 0.25) ✓
#
#   Để tạo 2 internal bottlenecks, dùng cột n ngoài = 2:
#   RIGHT: [-1, 2, C3k2, [128, False, 0.5]]
#          → inserts n=2 → C3k2(c1, 128, 2, False, 0.5) ✓
#
# Không dùng A2C2f (cùng vấn đề khi num_heads=0).
# Chỉ dùng: Conv · C3k2 · GhostConv · Concat · Upsample · Detect
# =============================================================================

nc: 10
ch: 3

backbone:
  # [from, n_outer, module, [c2, c3k, e, ...]]   ← KHÔNG có explicit n trong args
  # n_outer được parse_model chèn thành n bên trong module

  - [-1,  1, Conv,  [16, 3, 2]]          # 0  P1/2   16ch  (weight transfer ✓)
  - [-1,  1, Conv,  [32, 3, 2]]          # 1  P2/4   32ch  (weight transfer ✓)
  - [-1,  1, C3k2,  [64, False, 0.25]]  # 2  P2     64ch  → C3k2(c1,64,n=1,c3k=F,e=0.25) ✓
                                          #    ← P2 feats   (weight transfer ✓)
  - [-1,  1, Conv,  [64, 3, 2]]          # 3  P3/8   64ch  (weight transfer ✓)
  - [-1,  1, C3k2,  [128, False, 0.25]] # 4  P3    128ch  → C3k2(c1,128,1,F,0.25) ✓
                                          #    ← P3 feats   (weight transfer ✓)
  - [-1,  1, Conv,  [128, 3, 2]]         # 5  P4/16 128ch  (weight transfer ✓)
  - [-1,  2, C3k2,  [128, False, 0.5]]  # 6  P4    128ch  → C3k2(c1,128,n=2,c3k=F,e=0.5) ✓
                                          #    ← P4 feats   (no transfer — diff from A2C2f)
  - [-1,  1, Conv,  [256, 3, 2]]         # 7  P5/32 256ch  (weight transfer ✓)
  - [-1,  2, C3k2,  [256, False, 0.5]]  # 8  P5    256ch  → C3k2(c1,256,2,F,0.5) ✓
                                          #    ← P5 feats   (no transfer)

head:
  # FPN top-down — C3k2 [c2, c3k, e] không có explicit n
  - [-1,      1, nn.Upsample, [None, 2, 'nearest']]  # 9  upsample P5→P4
  - [[-1, 6], 1, Concat,      [1]]                    # 10 cat(256+128)=384ch
  - [-1,      1, C3k2,        [128, False]]            # 11 → C3k2(384,128,1,F) ✓

  - [-1,      1, nn.Upsample, [None, 2, 'nearest']]  # 12 upsample→P3
  - [[-1, 4], 1, Concat,      [1]]                    # 13 cat(128+128)=256ch
  - [-1,      1, C3k2,        [64, False]]             # 14 → C3k2(256,64,1,F) ✓  ← P3 base

  # P2 branch: 160×160@640px / 320×320@1280px
  - [14,      1, nn.Upsample, [None, 2, 'nearest']]  # 15 upsample→P2
  - [[-1, 2], 1, Concat,      [1]]                    # 16 cat(64+64)=128ch
  - [-1,      1, GhostConv,   [32]]                   # 17 128→32ch  ← P2 detect

  # PAN bottom-up: GhostConv (lightweight)
  - [17,       1, Conv,      [32, 3, 2]]              # 18 P2→P3 stride2
  - [[-1, 14], 1, Concat,    [1]]                     # 19 cat(32+64)=96ch
  - [-1,       1, GhostConv, [64]]                    # 20 96→64ch   ← P3 detect

  - [-1,       1, Conv,      [64, 3, 2]]              # 21 P3→P4 stride2
  - [[-1, 11], 1, Concat,    [1]]                     # 22 cat(64+128)=192ch
  - [-1,       1, GhostConv, [128]]                   # 23 192→128ch ← P4 detect

  - [-1,       1, Conv,      [128, 3, 2]]             # 24 P4→P5 stride2
  - [[-1, 8],  1, Concat,    [1]]                     # 25 cat(128+256)=384ch
  - [-1,       1, C3k2,      [256, True]]             # 26 → C3k2(384,256,1,True) ✓ ← P5 detect

  # 4-head Detect
  - [[17, 20, 23, 26], 1, Detect, [nc]]               # 27
